from numpy import *

a = array([2,3,4]) # создание одномерного массива целых чисел
print(a, a.ndim, a.shape) # вывод: массива, размерности, размера
print('----------------------------------------------------------------------------')

b = array([(1.5,2,3), (4,5,6)]) # создание двумерного массива
print(b, b.ndim, b.shape, b.size) #
print('----------------------------------------------------------------------------')


z = zeros((3,2)) # 3,2 в скобках как отдельный объект
print(z)
print('----------------------------------------------------------------------------')

ara = arange(15, 120, 10) # аналогична range, но возвращает массивы
print(ara)
print('----------------------------------------------------------------------------')

lin = linspace(0, 2, 9) # генерирует 9 чисел на отрезке от 0 до 2 с одинаковым шагом
print(lin)
print('----------------------------------------------------------------------------')

k = arange(12).reshape(4, 3)
print(k)
print('----------------------------------------------------------------------------')

